; domain
;Header and description

(define (domain cluster)

    ;remove requirements that are not needed
    (:requirements :strips :typing :conditional-effects :negative-preconditions)

    (:types
        worker master - computer
        router switch - network
        ebs bucket - storage
    )

    (:predicates
        ; computer

        ;; worker
        (worker-healthy ?worker - worker)
        (worker-high-mem ?worker - worker)
        (worker-high-cpu ?worker - worker)
        (worker-high-network ?worker - worker)

        ;; master
        (master-healthy ?master - master)

        ; network    

        ;; router
        (router-healthy ?router - router)
        (router-pair ?router1 ?router2 - router)

        ;; switch
        (switch-healthy ?switch - switch)
        (switch-attach-router ?switch - switch ?router - router)
        (switch-attach-master ?switch - switch ?master - master)
        (switch-attach-worker ?switch - switch ?worker - worker)

        ; storage

        ;; ebs
        (ebs-healthy ?ebs - ebs)
        (ebs-locked ?ebs - ebs)
        (ebs-attached ?ebs - ebs ?computer - computer)

        ;; bucket
        (bucket-healthy ?bucket - bucket)
        (bucket-locked ?bucket - bucket)
        (bucket-attached ?bucket - bucket ?master - master)
    )

    (:action worker-turn-on
        :parameters (?worker - worker ?switch - switch ?ebs - ebs)
        :precondition (and
            (not (worker-healthy ?worker))
            (ebs-healthy ?ebs)
            (switch-healthy ?switch)
            (not (ebs-locked ?ebs))
            (switch-attach-worker ?switch ?worker)
        )
        :effect (and
            (worker-healthy ?worker)
            (not (worker-high-cpu ?worker))
            (not (worker-high-mem ?worker))
            (not (worker-high-network ?worker))
            (ebs-attached ?ebs ?worker)
            (ebs-locked ?ebs)
        )
    )

    (:action worker-turn-off
        :parameters (?worker - worker ?switch - switch ?ebs - ebs)
        :precondition (and
            (switch-healthy ?switch)
            (switch-attach-worker ?switch ?worker)
            (ebs-attached ?ebs ?worker)
        )
        :effect (and
            (not (ebs-attached ?ebs ?worker))
            (not (ebs-locked ?ebs))
            (not (worker-healthy ?worker))
        )
    )

    (:action master-turn-on
        :parameters (?master - master ?switch - switch ?ebs - ebs ?bucket - bucket)
        :precondition (and
            (not (master-healthy ?master))
            (switch-healthy ?switch)
            (ebs-healthy ?ebs)
            (not (ebs-locked ?ebs))
            (bucket-healthy ?bucket)
            (not (bucket-locked ?bucket))
            (switch-attach-master ?switch ?master)
        )
        :effect (and
            (master-healthy ?master)
            (ebs-attached ?ebs ?master)
            (ebs-locked ?ebs)
            (bucket-attached ?bucket ?master)
            (bucket-locked ?bucket)
        )
    )

    (:action master-turn-off
        :parameters (?master - master ?switch - switch ?ebs - ebs ?bucket - bucket)
        :precondition (and
            (switch-healthy ?switch)
            (switch-attach-master ?switch ?master)
            (ebs-attached ?ebs ?master)
            (bucket-attached ?bucket ?master)
        )
        :effect (and
            (not (ebs-attached ?ebs ?master))
            (not (ebs-locked ?ebs))
            (not (bucket-attached ?bucket ?master))
            (not (bucket-locked ?bucket))
            (not (master-healthy ?master))
        )
    )

    (:action router-turn-on
        :parameters (?router - router)
        :precondition (and
            (not (router-healthy ?router))
        )
        :effect (and
            (router-healthy ?router)
        )
    )

    (:action router-turn-off
        :parameters (?router - router)
        :precondition (and
            (router-healthy ?router)
        )
        :effect (and
            (not (router-healthy ?router))
        )
    )

    (:action router-mesh-on
        :parameters (?router1 ?router2 - router)
        :precondition (and
            (router-healthy ?router1)
            (router-healthy ?router2)
            (not (router-pair ?router1 ?router2))
        )
        :effect (and
            (router-pair ?router1 ?router2)
        )
    )

    (:action router-mesh-off
        :parameters (?router1 ?router2 - router)
        :precondition (and
            (router-healthy ?router1)
            (router-healthy ?router2)
            (router-pair ?router1 ?router2)
        )
        :effect (and
            (not (router-pair ?router1 ?router2))
        )
    )

    (:action switch-turn-on
        :parameters (?switch - switch ?router - router)
        :precondition (and
            (not (switch-healthy ?switch))
            (router-healthy ?router)
        )
        :effect (and
            (switch-healthy ?switch)
            (switch-attach-router ?switch ?router)
        )
    )

    (:action switch-turn-off
        :parameters (?switch - switch ?router - router)
        :precondition (and
            (switch-healthy ?switch)
        )
        :effect (and
            (not (switch-healthy ?switch))
            (not (switch-attach-router ?switch ?router))
        )
    )

    (:action ebs-turn-on
        :parameters (?ebs - ebs)
        :precondition (and
            (not (ebs-healthy ?ebs))
        )
        :effect (and
            (ebs-healthy ?ebs)
            (not (ebs-locked ?ebs))
        )
    )

    (:action ebs-turn-off
        :parameters (?ebs - ebs)
        :precondition (and
            (ebs-healthy ?ebs)
        )
        :effect (and
            (not (ebs-healthy ?ebs))
        )
    )

    (:action bucket-turn-on
        :parameters (?bucket - bucket)
        :precondition (and
            (not (bucket-healthy ?bucket))
        )
        :effect (and
            (bucket-healthy ?bucket)
            (not (bucket-locked ?bucket))
        )
    )

    (:action bucket-turn-off
        :parameters (?bucket - bucket)
        :precondition (and
            (bucket-healthy ?bucket)
        )
        :effect (and
            (not (bucket-healthy ?bucket))
        )
    )

)

; problem
(define (problem pb2)
    (:domain cluster)
    (:objects
        ; computers
        tesla newton einstein hawking - master
        w1 w2 w3 w4 w5 w6 w7 w8 w9 w10 w11 w12 - worker

        ; network
        router1 router2 - router
        switch1 switch2 switch3 switch4 - switch

        ; storages
        ebs1 ebs2 ebs3 ebs4 - ebs
        ebs5 ebs6 ebs7 ebs8 - ebs
        ebs9 ebs10 ebs11 ebs12 - ebs
        ebs13 ebs14 ebs15 ebs16 - ebs

        bucket1 bucket2 bucket3 bucket4 - bucket
    )

    (:init
        ; routers
        ( router-healthy router1)
        ( router-healthy router2)
        ( router-pair router1 router2)

        ; tesla
        ( master-healthy tesla)
        ( switch-healthy switch1)

        ( worker-healthy w1)
        ( worker-healthy w2)
        ( worker-healthy w3)

        ( ebs-healthy ebs1)
        ( ebs-locked ebs1)
        ( ebs-healthy ebs2)
        ( ebs-locked ebs2)
        ( ebs-healthy ebs3)
        ( ebs-locked ebs3)
        ( ebs-healthy ebs4)
        ( ebs-locked ebs4)
        ( bucket-healthy bucket1)
        ( bucket-locked bucket1)

        ( switch-attach-router switch1 router1)
        ( switch-attach-master switch1 tesla)
        ( switch-attach-worker switch1 w1)
        ( switch-attach-worker switch1 w2)
        ( switch-attach-worker switch1 w3)
        ( bucket-attached bucket1 tesla)
        ( ebs-attached ebs1 tesla)
        ( ebs-attached ebs2 w1)
        ( ebs-attached ebs3 w2)
        ( ebs-attached ebs4 w3)

        ; newton
        ( master-healthy newton)
        ( switch-healthy switch2)

        ( worker-healthy w4)
        ( worker-healthy w5)
        ( worker-high-cpu w5) ; issue
        ( worker-healthy w6)

        ( ebs-healthy ebs5)
        ( ebs-locked ebs5)
        ( ebs-healthy ebs6)
        ( ebs-locked ebs6)
        ( ebs-healthy ebs7)
        ( ebs-locked ebs7)
        ( ebs-healthy ebs8)
        ( ebs-locked ebs8)
        ( bucket-healthy bucket2)
        ( bucket-locked bucket2)

        ( switch-attach-router switch2 router1)
        ( switch-attach-master switch2 newton)
        ( switch-attach-worker switch2 w4)
        ( switch-attach-worker switch2 w5)
        ( switch-attach-worker switch2 w6)
        ( bucket-attached bucket2 newton)
        ( ebs-attached ebs5 newton)
        ( ebs-attached ebs6 w4)
        ( ebs-attached ebs7 w5)
        ( ebs-attached ebs8 w6)

        ; einstein
        ( master-healthy einstein)
        ( switch-healthy switch3)

        ( not (worker-healthy w7)) ; issue
        ( worker-healthy w8)
        ( worker-healthy w9)

        ( ebs-healthy ebs9)
        ( ebs-locked ebs9)
        ( ebs-healthy ebs10)
        ( not (ebs-locked ebs10)) ; issue
        ( ebs-healthy ebs11)
        ( ebs-locked ebs11)
        ( ebs-healthy ebs12)
        ( ebs-locked ebs12)
        ( bucket-healthy bucket3)
        ( bucket-locked bucket3)

        ( switch-attach-router switch3 router2)
        ( switch-attach-master switch3 einstein)
        ( switch-attach-worker switch3 w7)
        ( switch-attach-worker switch3 w8)
        ( switch-attach-worker switch3 w9)
        ( bucket-attached bucket3 einstein)
        ( ebs-attached ebs9 einstein)
        ( not (ebs-attached ebs10 w7)) ; issue
        ( ebs-attached ebs11 w8)
        ( ebs-attached ebs12 w9)

        ; hawking
        ( master-healthy hawking)
        ( switch-healthy switch4)

        ( worker-healthy w10)
        ( worker-high-mem w10) ; issue
        ( worker-high-network w10) ; issue
        ( worker-healthy w11)
        ( worker-healthy w12)

        ( ebs-healthy ebs13)
        ( ebs-locked ebs13)
        ( ebs-healthy ebs14)
        ( ebs-locked ebs14)
        ( ebs-healthy ebs15)
        ( ebs-locked ebs15)
        ( ebs-healthy ebs16)
        ( ebs-locked ebs16)
        ( not (bucket-healthy bucket4))
        ( not (bucket-locked bucket4))

        ( switch-attach-router switch4 router2)
        ( switch-attach-master switch4 hawking)
        ( switch-attach-worker switch4 w10)
        ( switch-attach-worker switch4 w11)
        ( switch-attach-worker switch4 w12)
        ( bucket-attached bucket4 hawking)
        ( ebs-attached ebs13 hawking)
        ( ebs-attached ebs14 w10)
        ( ebs-attached ebs15 w11)
        ( ebs-attached ebs16 w12)
    )

    (:goal
        (and
            ; routers
            ( router-healthy router1)
            ( router-healthy router2)
            ( router-pair router1 router2)

            ; tesla
            ( master-healthy tesla)
            ( switch-healthy switch1)

            ( worker-healthy w1)
            ( not (worker-high-cpu w1))
            ( not (worker-high-mem w1))
            ( not (worker-high-network w1))

            ( worker-healthy w2)
            ( not (worker-high-cpu w2))
            ( not (worker-high-mem w2))
            ( not (worker-high-network w2))

            ( worker-healthy w3)
            ( not (worker-high-cpu w3))
            ( not (worker-high-mem w3))
            ( not (worker-high-network w3))

            ( ebs-healthy ebs1)
            ( ebs-locked ebs1)
            ( ebs-healthy ebs2)
            ( ebs-locked ebs2)
            ( ebs-healthy ebs3)
            ( ebs-locked ebs3)
            ( ebs-healthy ebs4)
            ( ebs-locked ebs4)
            ( bucket-healthy bucket1)
            ( bucket-locked bucket1)

            ( switch-attach-router switch1 router1)
            ( switch-attach-master switch1 tesla)
            ( switch-attach-worker switch1 w1)
            ( switch-attach-worker switch1 w2)
            ( switch-attach-worker switch1 w3)
            ( bucket-attached bucket1 tesla)
            ( ebs-attached ebs1 tesla)
            ( ebs-attached ebs2 w1)
            ( ebs-attached ebs3 w2)
            ( ebs-attached ebs4 w3)

            ; newton
            ( master-healthy newton)
            ( switch-healthy switch2)

            ( worker-healthy w4)
            ( not (worker-high-cpu w4))
            ( not (worker-high-mem w4))
            ( not (worker-high-network w4))

            ( worker-healthy w5)
            ( not (worker-high-cpu w5))
            ( not (worker-high-mem w5))
            ( not (worker-high-network w5))

            ( worker-healthy w6)
            ( not (worker-high-cpu w6))
            ( not (worker-high-mem w6))
            ( not (worker-high-network w6))

            ( ebs-healthy ebs5)
            ( ebs-locked ebs5)
            ( ebs-healthy ebs6)
            ( ebs-locked ebs6)
            ( ebs-healthy ebs7)
            ( ebs-locked ebs7)
            ( ebs-healthy ebs8)
            ( ebs-locked ebs8)
            ( bucket-healthy bucket2)
            ( bucket-locked bucket2)

            ( switch-attach-router switch2 router1)
            ( switch-attach-master switch2 newton)
            ( switch-attach-worker switch2 w4)
            ( switch-attach-worker switch2 w5)
            ( switch-attach-worker switch2 w6)
            ( bucket-attached bucket2 newton)
            ( ebs-attached ebs5 newton)
            ( ebs-attached ebs6 w4)
            ( ebs-attached ebs7 w5)
            ( ebs-attached ebs8 w6)

            ; einstein
            ( master-healthy einstein)
            ( switch-healthy switch3)

            ( worker-healthy w7)
            ( not (worker-high-cpu w7))
            ( not (worker-high-mem w7))
            ( not (worker-high-network w7))

            ( worker-healthy w8)
            ( not (worker-high-cpu w8))
            ( not (worker-high-mem w8))
            ( not (worker-high-network w8))

            ( worker-healthy w9)
            ( not (worker-high-cpu w9))
            ( not (worker-high-mem w9))
            ( not (worker-high-network w9))

            ( ebs-healthy ebs9)
            ( ebs-locked ebs9)
            ( ebs-healthy ebs10)
            ( ebs-locked ebs10)
            ( ebs-healthy ebs11)
            ( ebs-locked ebs11)
            ( ebs-healthy ebs12)
            ( ebs-locked ebs12)
            ( bucket-healthy bucket3)
            ( bucket-locked bucket3)

            ( switch-attach-router switch3 router2)
            ( switch-attach-master switch3 einstein)
            ( switch-attach-worker switch3 w7)
            ( switch-attach-worker switch3 w8)
            ( switch-attach-worker switch3 w9)
            ( bucket-attached bucket3 einstein)
            ( ebs-attached ebs9 einstein)
            ( ebs-attached ebs10 w7)
            ( ebs-attached ebs11 w8)
            ( ebs-attached ebs12 w9)

            ; hawking
            ( master-healthy hawking)
            ( switch-healthy switch4)

            ( worker-healthy w10)
            ( not (worker-high-cpu w10))
            ( not (worker-high-mem w10))
            ( not (worker-high-network w10))

            ( worker-healthy w11)
            ( not (worker-high-cpu w11))
            ( not (worker-high-mem w11))
            ( not (worker-high-network w11))

            ( worker-healthy w12)
            ( not (worker-high-cpu w12))
            ( not (worker-high-mem w12))
            ( not (worker-high-network w12))

            ( ebs-healthy ebs13)
            ( ebs-locked ebs13)
            ( ebs-healthy ebs14)
            ( ebs-locked ebs14)
            ( ebs-healthy ebs15)
            ( ebs-locked ebs15)
            ( ebs-healthy ebs16)
            ( ebs-locked ebs16)
            ( bucket-healthy bucket4)
            ( bucket-locked bucket4)

            ( switch-attach-router switch4 router2)
            ( switch-attach-master switch4 hawking)
            ( switch-attach-worker switch4 w10)
            ( switch-attach-worker switch4 w11)
            ( switch-attach-worker switch4 w12)
            ( bucket-attached bucket4 hawking)
            ( ebs-attached ebs13 hawking)
            ( ebs-attached ebs14 w10)
            ( ebs-attached ebs15 w11)
            ( ebs-attached ebs16 w12)
        )
    )
)

; plan
1. (worker-turn-on w7 switch3 ebs10)
   added: (worker-healthy w7) (ebs-attached ebs10 w7) (ebs-locked ebs10)
   goals met: 134 of 139
2. (bucket-turn-on bucket4)
   added: (bucket-healthy bucket4)
   goals met: 135 of 139
3. (worker-turn-off w5 switch2 ebs7)
   deleted: (ebs-attached ebs7 w5) (ebs-locked ebs7) (worker-healthy w5)
   goals met: 132 of 139
4. (worker-turn-on w5 switch2 ebs7)
   deleted: (worker-high-cpu w5)
   added: (worker-healthy w5) (ebs-attached ebs7 w5) (ebs-locked ebs7)
   goals met: 136 of 139
5. (master-turn-off hawking switch4 ebs13 bucket4)
   deleted: (ebs-attached ebs13 hawking) (ebs-locked ebs13) (bucket-attached bucket4 hawking) (master-healthy hawking)
   goals met: 132 of 139
6. (master-turn-on hawking switch4 ebs13 bucket4)
   added: (master-healthy hawking) (ebs-attached ebs13 hawking) (ebs-locked ebs13) (bucket-attached bucket4 hawking) (bucket-locked bucket4)
   goals met: 137 of 139
7. (worker-turn-off w10 switch4 ebs14)
   deleted: (ebs-attached ebs14 w10) (ebs-locked ebs14) (worker-healthy w10)
   goals met: 134 of 139
8. (worker-turn-on w10 switch4 ebs14)
   deleted: (worker-high-mem w10) (worker-high-network w10)
   added: (worker-healthy w10) (ebs-attached ebs14 w10) (ebs-locked ebs14)
   goals met: 139 of 139
